{
	"id": "monRandomizer",
	"hasDylib": false,
	"hasQML": false,
	"category": "randomizer",
	"order": 20,
	"loadOrder": 20,
	"defaults": {

		"randomizeSpawns": true,
		"spawnedCount": 5,
		"maxTypes": 25,
		"randomizeResistances": false,
		"hellResistances": false

	},
	"controls": [
				
		{ "id": "randomizeSpawns", "type": "checkbox" },
		{ "id": "spawnedCount", "type": "sliderMinMax", "min": 2, "max": 10},
		{ "id": "maxTypes", "type": "sliderMinMax", "min": 3, "max": 25 },
		{ "id": "randomizeResistances", "type": "checkbox" },
		{ "id": "hellResistances", "type": "checkbox" }
	],
	"locales": {
		"ru_RU": {
			"title": "Рандомайзер Монстров",
			"help": ["При включении этой возможности, теперь каждая зона карты в игре может сгенерировать любых врагов из любых актов.",
				"Для Normal, враги получают подогнанные по уровню невидимые копии (т.к. иначе невозможно победить врагов из 5 акта в первом)",
				"Для Nigtmare/Hell, параметры автоматически подгонятся под уровень зоны.",
				"Монстры так же получают адаптированные парамтеры для миньонов и уровни навыков."],
			
			"presets": [],
			"controlsTitles": {
				"randomizeSpawns": "Случайная генерация монстров в каждой зоне",
				"spawnedCount": "Сколько в одной зоне может быть разных типов монстров",
				"maxTypes": "Максимально возможно потенциальное число типов монстров",
				"randomizeResistances": "Случайные сопротивления",
				"hellResistances": "Использовать сопротивления от Hell на NM/Normal"
			},
			"controlsHelps": {
				"spawnedCount": ["Сколько в одной генерации будет различных типов врагов (по умолчанию 3, как и в оригинале D2). ",
					"Обратите внимение, что некоторые зоны имеют тайлы с фиксированными спавнами (группы шаманов например)."],
				"maxTypes": ["Эта опция регулирует, как много разных типов в принципе ",
					"могут быть в одной зоне от генерации к генерации.",
					"Примечание: для D2 Legacy значение будет автоматом снижено до 12."]
			}
		},
		"en_US": {
			"title": "Monster Randomizer",
			"help": ["When this feature enabled, now any area in the game can spawn any basic monsters (Super Uniques, Act bosses etc not affected).",
				"For normal difficulty, each monster will have a 'level-adjusted' copy which corresponds",
				"to area's level (so you will have adequate monster stats in Act 1 for guest from Act 5).",
				"For Nightmare/Hell, adjustment is done by area level.",
				"Monster will have adjusted their minion spawns and skill levels, too."],
			
			"presets": [],
			"controlsTitles": {
				"randomizeSpawns": "Random monster spawn in areas",
				"spawnedCount": "Spawned different types in one area",
				"maxTypes": "Maximum possible monster types in one area (population variety)",
				"randomizeResistances": "Random resistances",
				"hellResistances": "Use Hell resistances on NM/Normal"
			},
			"controlsHelps": {
				"spawnedCount": ["This option choose how many different types will spawn at once (default is 3, which is D2 original behavior).",
					"Note that some map tiles have predefined spawns (shaman camps etc) that can not be randomized."],
				"maxTypes": ["This option defines how many possibilites for monster types are exist in one zone;",
					"Make this value lower if you want less variety between game restarts.",
					"Note: D2 legacy support only 12 max, so value will be lowered implicitly."]
			}
		},
        "ko_KR": {
            "title": "몬스터 랜덤화",
            "help": [
				"이 기능을 켜면 모든 지역에 모든 종류의 일반 몬스터가 등장할 수 있습니다 (슈퍼 유니크, 액트 보스 제외).",
				"일반 난이도: 몬스터가 현재 등장한 지역의 레벨에 맞춰 능력치가 조정됩니다.",
				"예: 액트 5의 몬스터가 액트 1에 나타나도 액트 1 레벨에 맞는 능력치를 가집니다.",
				"악몽/지옥 난이도: 몬스터의 능력치가 단순히 현재 지역의 레벨에 맞춰 조정됩니다.",
				"몬스터의 하수인 생성과 스킬 레벨도 함께 조정됩니다."
			],
			
			"presets": [],
			"controlsTitles": {
				"randomizeSpawns": "랜덤 몬스터 생성",
				"spawnedCount": "한 지역 내 출현 몬스터 종류 수",
				"maxTypes": "한 지역 최대 몬스터 종류 수 (다양성)",
				"randomizeResistances": "랜덤 저항력 부여",
                "hellResistances": "악몽/일반 난이도에서 지옥 난이도 저항력 사용"
			},
			"controlsHelps": {
				"spawnedCount": [
					"한 번에 출현할 몬스터 종류의 수를 설정합니다 (기본값 3, 원작과 동일).",
					"주의: 일부 지역(예: 샤먼 캠프)은 미리 정해진 몬스터가 출현하여 랜덤화되지 않습니다."
				],
				"maxTypes": [
					"한 지역에 등장 가능한 몬스터 종류의 최대 수를 설정합니다.",
					"게임 재시작 시 다양성을 줄이려면 이 값을 낮게 설정하세요.",
					"주의: 원작은 최대 12종까지만 지원하므로, 그 이상으로 설정하면 자동으로 12로 조정됩니다."]
			}
		}
	}
}
